#include <stdio.h>

int main()
{
    //方式1： 定义一个2行3列的二维数组
    int intarray[2][3];

    intarray[0][0] = 10;
    intarray[0][1] = 20;
    intarray[0][2] = 30;
    intarray[1][0] = 40;
    intarray[1][1] = 50;
    intarray[1][2] = 60;

    //方式2，定义一个2行3列的二维数组
    int arrays2[2][3]= {
        {10,20,30},
        {40,50,60}
    };


    //方式3，定义一个2行3列的二维数组，会自动匹配到各行各列
    int arrays3[2][3] = {10,20,30,40,50,60};


        //方式4,如果所赋值的数量与元素数量对应，则第一个数组长度可以不给出
    int arrays4[][3] = {10,20,30,40,50,60};

    return 0;
}